In [1]:
import pandas as pd
tips = pd.read_csv('data/tips.csv')

In [2]:
tips.shape

(244, 7)

In [3]:
tips.index

RangeIndex(start=0, stop=244, step=1)

In [4]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [5]:
file = open('data/tips.csv','r')
lines = file.readlines()
file.close()
len(lines)

245

In [6]:
header = lines[0]
lines = lines[1:]

In [7]:
header = header[0:-1]
print(header)
header = header.split(',')
print(header)

total_bill,tip,sex,smoker,day,time,size
['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size']

In [8]:
lines[0]

'16.99,1.01,Female,No,Sun,Dinner,2\n'

In [11]:
temp = []
for line in lines:
    temp.append(line[0:-1].split(','))
    pass

In [12]:
temp[0:3]

[['16.99', '1.01', 'Female', 'No', 'Sun', 'Dinner', '2'],
 ['10.34', '1.66', 'Male', 'No', 'Sun', 'Dinner', '3'],
 ['21.01', '3.5', 'Male', 'No', 'Sun', 'Dinner', '3']]

In [13]:
df_tips = pd.DataFrame(temp,columns=header)

In [14]:
df_tips.head()

  total_bill   tip     sex smoker  day    time size
0      16.99  1.01  Female     No  Sun  Dinner    2
1      10.34  1.66    Male     No  Sun  Dinner    3
2      21.01   3.5    Male     No  Sun  Dinner    3
3      23.68  3.31    Male     No  Sun  Dinner    2
4      24.59  3.61  Female     No  Sun  Dinner    4

In [15]:
def convert_num(x):
    return float(x)


df_tips['size'] = df_tips['size'].apply(convert_num)

In [16]:
df_tips['total_bill'] = df_tips['total_bill'].apply(convert_num)

In [17]:
df_tips.total_bill.mean()

19.785942622950824

In [18]:
tips.head()

       0     1       2   3    4       5  6
0  16.99  1.01  Female  No  Sun  Dinner  2
1  10.34  1.66    Male  No  Sun  Dinner  3
2  21.01   3.5    Male  No  Sun  Dinner  3
3  23.68  3.31    Male  No  Sun  Dinner  2
4  24.59  3.61  Female  No  Sun  Dinner  4

In [18]:
tips['sex_recode'] = 0

In [19]:
tips.head(5)

   total_bill   tip     sex smoker  day    time  size  sex_recode
0       16.99  1.01  Female     No  Sun  Dinner     2           0
1       10.34  1.66    Male     No  Sun  Dinner     3           0
2       21.01  3.50    Male     No  Sun  Dinner     3           0
3       23.68  3.31    Male     No  Sun  Dinner     2           0
4       24.59  3.61  Female     No  Sun  Dinner     4           0

In [22]:
tips.loc[tips.sex=='Male','sex_recode'] = 1

In [23]:
tips.head(5)

   total_bill   tip     sex smoker  day    time  size  sex_recode
0       16.99  1.01  Female     No  Sun  Dinner     2           0
1       10.34  1.66    Male     No  Sun  Dinner     3           1
2       21.01  3.50    Male     No  Sun  Dinner     3           1
3       23.68  3.31    Male     No  Sun  Dinner     2           1
4       24.59  3.61  Female     No  Sun  Dinner     4           0

In [24]:
tips.loc[0].values

array([16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2, 0], dtype=object)

In [25]:
tips.loc[:,['tip','sex']].head(3)
tips['size'].describe()

count    244.000000
mean       2.569672
std        0.951100
min        1.000000
25%        2.000000
50%        2.000000
75%        3.000000
max        6.000000
Name: size, dtype: float64

In [26]:
tips['size'].unique()

array([2, 3, 4, 1, 6, 5])

In [27]:
tips.groupby(['sex','time']).mean()

               total_bill       tip      size  sex_recode
sex    time
Female Dinner   19.213077  3.002115  2.461538         0.0
       Lunch    16.339143  2.582857  2.457143         0.0
Male   Dinner   21.461452  3.144839  2.701613         1.0
       Lunch    18.048485  2.882121  2.363636         1.0

In [28]:
tips.groupby(['sex','time'])['sex'].count()

sex     time
Female  Dinner     52
        Lunch      35
Male    Dinner    124
        Lunch      33
Name: sex, dtype: int64

In [29]:
for (name1),group in tips.groupby('sex'):
    print(name1)
    print(group.mean())
    print(group['tip'].mean()/group['total_bill'].mean())
    pass

Female
total_bill    18.056897
tip            2.833448
size           2.459770
sex_recode     0.000000
dtype: float64
0.15691778859925523
Male
total_bill    20.744076
tip            3.089618
size           2.630573
sex_recode     1.000000
dtype: float64
0.14893976332741748

In [30]:
df_test = tips[['total_bill','tip']]

In [31]:
df_test.loc[:,'total_bill'].sum()

4827.77

In [32]:
df_test.loc[0,:].sum()

18.0